[[10237, 200, "01/11/1998: In one of two linked incidents, member of the Armed Islamic Group (GIA) threw an explosive device into a mosque, then gunned down survivors as they were fleeing. The exact number of casualties resulting from this and the related incident was unknown with estimates of civilians killed ranging betweeen 120 and 400."], [10258, 320, "02/01/1998: Sri Lankan troops beat back an assault by the Liberation Tamil Tigers if Eelam (LTTE), killing 300 guerrillas. Twenty soldiers were also killed and another 80 wounded in the five-hour battle near Kilinochchi, Sri Lanka, about 265 kilometers north of Colombo."], [10441, 275, "08/03/1998: In a series of related incidents, rebels belonging to the Fuerzas Armadas Revolucionarias de Colombia (FARC) and the National Liberation Army (NLA) conducted at least 42 attacks throughout the country on August 3 and August 4, 1998, leaving 275 dead and many wounded. The rebels targeted the Colombian government and military, oil lines and pumps, and private citizens. They also set off car bombs in city centers and villages. Nearly 30 soldiers and police were missing and presumably kidnapped."], [10445, 224, "08/07/1998: Suicide attackers detonated a vehicle bomb outside of the United States Embassy in Nairobi, Kenya, killing 224 people, including 12 Americans. Four thousand people were also injured in the attack, which was perpetrated by Al-Qaida."], [11033, 200, "03/17/2000:  Followers of the Movement for the Restoration of the Ten Commandments of God were killed when they drank tea tainted with an unknown chemical.  The attack killed 200 followers in the Kasese District of Uganda."], [11329, 150, "1/7/2001: Taliban militia regained control of Yakawlang town, Bamyan, Afghanistan.  For the next three days, the Taliban proceeded to go from house to house, gathering and shooting the local men.  Reports indicate that at least 170 people were killed in the attack.  Sources indicate that the orders for the massacre came from Taliban leader Mullah Mohammed Omar; Omar denies the incident took place."], [11545, 259, "08/11/2001: A mine placed by the National Union for the Total Independence of Angola (UNITA) derailed a train carrying refugees between Luanda and Dondo in Angola. The militants stopped the train with an anti-tank mine then fired at the train cars. Approximately 259 people were killed outright or died later from the attack and more than 160 were wounded."], [11576, 1384, "09/11/2001: This was one of four related attacks that occurred in the United States that are known collectively as the 9/11 Terrorist Attacks. In the first attack, which occurred at 8:46 am local time, American Airlines Flight 11 crashed into the North Tower of the World Trade Center Complex in New York City, New York. Five hijackers belonging to Al-Qaida took control of the Boeing 767 aircraft on a flight originating from Logan International Airport in Boston, Massachusetts, and destined for Los Angeles International Airport. There were 76 passengers, 11 crew members and five hijackers on the plane, all of whom died upon impact. The North Tower collapsed at 10:28 a.m. local time after the South Tower had collapsed at 9:59 a.m. local time. At least 2,767 people died as a result of the attacks in New York City, including 10 hijackers as well as responders who contracted cancer and respiratory illnesses at the attack site and passed away years later. More than 16,000 others were injured. Al-Qaida leaders including Osama bin Laden and Khalid Shaikh Mohammed claimed responsibility for the attacks in multiple videotaped interviews."], [11576, 1383, "09/11/2001: This was one of four related attacks that occurred in the United States that are known collectively as the 9/11 Terrorist Attacks. In the second of these attacks, which occurred at 9:03 a.m. local time, United Airlines Flight 175 crashed into the South Tower of the World Trade Center Complex in New York City, New York. Five hijackers belonging to Al-Qaida hijacked the Boeing 767 aircraft on a flight originating from Logan International Airport in Boston, Massachusetts, and destined for Los Angeles International Airport. There were 56 passengers, nine crew members and five hijackers on the plane, all of whom died upon impact. The South Tower collapsed at 9:59 a.m. local time, killing all who were trapped inside or located nearby. The North Tower collapsed, after having been struck by American Airlines Flight 11, at 10:28 a.m. local time. At least 2,767 people died as a result of the attacks in New York City, including 10 hijackers as well as responders who contracted cancer and respiratory illnesses at the attack site and passed away years later. More than 16,000 others were injured. Al-Qaida leaders including Osama bin Laden and Khalid Shaikh Mohammed claimed responsibility for the attacks in multiple videotaped interviews."], [11576, 190, "09/11/2001: This was one of four related attacks that occurred in the United States that are known collectively as the 9/11 Terrorist Attacks. In the third of these attacks, which occurred at 9:37 am local time, American Airlines Flight 77 crashed into the Pentagon in Arlington, Virginia. Five hijackers belonging to Al-Qaida hijacked the Boeing 757 aircraft on a flight from Washington Dulles International Airport to for Los Angeles International Airport and proceeded to fly the plane into the western side of the Pentagon. At least 190 people died as a result of the attack at the Pentagon. There were 53 passengers, six crew members and five hijackers on the plane, all of whom died on impact. In addition, 125 people died in the Pentagon due to the impact or in the resulting fire, and at least one first responder died as a result of illness contracted due to exposure to contaminants at the attack site. Al-Qaida leaders including Osama bin Laden and Khalid Shaikh Mohammed claimed responsibility for the attacks in multiple videotaped interviews."], [11788, 170, "04/11/2002: A group of rebel Maoists attacked the Nepal Armed Police Force outpost near Sadbariya in the Dang District. 84 police officers, four civilians, and approximately 62 rebels were killed in the attack. The exact motive is unknown."], [11983, 170, "10/23/2002: Forty Chechen rebels attacked Dubrovka Theater in Moscow, Russia and took 912 hostages.  The assailants demanded a complete pullout of all Russian military forces from Chechnya in exchange for the release of the hostages.  The siege lasted until 26 October 2002, when Russian special forces filled the building with an unidentified gas intended to subdue the perpetrators. The gas killed all 40 perpetrators and 125 hostages. Five additional hostages were killed by the attackers during a shoot-out."], [12498, 518, "03/21/2004: Nepalese Communist Party (Maoist) members attacked a small town in Bedi, Nepal. During the attack, the Maoists bombed a bridge, looted a state-owned bank, bombed local administrative offices, freed prisoners from a local jail, and bombed an airport. Government forces battled confronted Maoists in long battle, which reportedly killed 500 Maoists and 18 security personnel and wounded 200 Maoists and 16 security personnel."], [12662, 344, "09/01/2004: A group of thirty to thirty-five armed Chechen and Ingush rebels, including men and women, many wearing suicide bomber belts, seized a school in Beslan in the Pravoberezhny district of North Ossetia, Russia. The perpetrators took approximately 1200 children, parents, and teachers hostage in the school gym. By the conclusion of the siege 727 people had been injured and approximately 344 had been killed."], [13040, 160, "09/14/2005: A rash of more than a dozen of bombs rocked Baghdad beginning shortly after dawn and continuing until about 4 p.m. The explosions took place mainly in the heavily Shi i neighborhood of Kazimiyah where laborers had gathered shortly after dawn. At least 160 people were killed and another 570 were wounded. A senior US military official said the bombings could have been retaliation for the joint U.S.-Iraqi sweep through the northern city of Tal Afar to evict insurgents from their strongholds there. Al-Qaida in Iraq posted a statement on a website claiming responsibility for the attack.  However, the authenticity of the claim had not been confirmed."], [13280, 200, "05/12/2006: An unknown number of members of the Movement for the Emancipation of the Niger Delta (MEND) used explosives to blow up an oil pipline killing 200 in Atlas Creek Island, Nigeria."], [13340, 188, "07/11/2006: A series of train bombings killed at least 188 civilians in Mumbai, India. The train bombing injured another 817 others injured in a string of seven blasts that spanned 56 kms, from Churchgate to Mira Road. One of the 13 arrested suspects, Asif Bashir Khan alias Junaid, emerged as the chief operative of the militant outfit, Lashkar-e Taiba. Fifteen others remained wanted at the time, including nine Pakistani nationals."], [13475, 205, "11/23/2006: Five car bombs exploded, three suicide bombs and two detonated in parked cars, and two mortars struck Sadr City, the Shi i slum in Baghdad, Iraq, killing 202 and injuring 257. The car bombs exploded at 15 minute intervals while the mortars struck at the same time. The car bombs struck Jamila market, al-Hay market and al-Shahidein Square, while the mortars landed in al-Shahidein Square and Mudhafar Square; there were no security forces present at the bombing sites. No group immediately claimed responsibility for the attacks."], [13599, 153, "03/27/2007: In one of two truck bombings carried out by suspected Sunni militants in Tal Afar, Iraq, 152 people were killed and 347 were wounded when a truck containing flour exploded near a wholesale market on the city's north side.  No claim of responsibility was reported."], [13701, 150, "07/07/2007: The largest suicide bombing of the Iraq war to date was set off in the small village of Amerli in the Diyala Governorate of Iraq.  Over 150 people were killed and 250 wounded in the truck bomb attack on the Turkomen village.  Fifty homes were destroyed in the attack where many people were trapped beneath the rubble.  No claim of responsibility was reported."], [13739, 250, "08/14/2007: Four coordinated vehicle bombs killed at least 500 and and injured 1500 in the towns of Qahtaniya and Jazeera, Iraq. The blasts targeted minority Yazidis, who speak a dialect of Kurdish and follow a pre-Islamic religion. The exact locations of the explosions within each town were not reported, but rescue workers report that 80 percent of the villages were destroyed or damaged. No group claimed responsibility for the attack, but authorities blamed al Qaida in Iraq."], [13739, 250, "08/14/2007: Four coordinated vehicle bombs killed at least 500 and and injured 1500 in the towns of Qahtaniya and Jazeera, Iraq. The blasts targeted minority Yazidis, who speak a dialect of Kurdish and follow a pre-Islamic religion. The exact locations of the explosions within each town were not reported, but rescue workers report that 80 percent of the villages were destroyed or damaged. No group claimed responsibility for the attack, but authorities blamed al Qaida in Iraq."], [13911, 160, "2/2/2008: Chadian rebels attacked the capital city of N'Djamena, in N'Djamena region, Chad.  The rebels engaged in three days of fighting with military forces, finally agreeing to a cease-fire on February 5, 2008.  Hundreds of civilians and an unknown number of rebels and military personnel were killed in the attack; more than one thousand people were wounded.  Stores and businesses in the downtown sector were looted, as were the parliament buildings and the state broadcasting station.  Approximately 20,000 residents fled the city during the assault.  The rebels entered the city with the intention of toppling President Deby; they directed their attack towrds the presidential palace."], [14261, 400, "01/17/2009: On Saturday evening, in the village of Tora and Libombi, near Tora, Orientale, Democratic Republic of the Congo, assailants set fire to a church, killing hundreds of worshippers. The assailants then attacked residents of several homesteads with axes and similar weapons, killing several civilians at each homestead. The assailants also set fire to and damaged several residences and businesses. No group claimed responsibility, although it was widely believed the Lord's Resistance Army was responsible."], [14430, 184, "07/05/2009: On Sunday, Muslim Uighurs rampaged through the streets and attacked Han Chinese in Urumqi, the capital of China's north-west Xinjiang region. The protestors began attacking ethnic Han pedestrians, burning vehicles and attacking buses with batons and rocks. Sources report that protestors from the Uighur Muslim ethnicity took to the street carrying knives, wooden batons, bricks and stones. Updated reports maintain a death toll of 184, 137 of which were Han Chinese, 46 Uighur, and one of Hui ethnicity. The number of people injured in ethnic violence in China's Urumqi has risen to 1,650. Reports did not say whether any of the dead were killed by security forces."], [15403, 210, "03/04/2012: Assailants attacked an army base on the outskirts of Zinjibar city, Abyan governorate, Yemen. Over the course of the attack, 25 assailants and 185 soldiers were killed, and 73 soldiers were kidnapped. The kidnapped men were released on April 28, 2012. Al-Qa'ida in the Arabian Peninsula (AQAP) claimed responsibility for the incident."], [15659, 153, "11/15/2012: Assailants attacked military troops in the Kibumba area of North Kivu province, Democratic Republic of the Congo. Approximately 151 assailants and two soldiers were killed. In addition, seven soldiers and an unknown number of assailants were injured in the ensuing clash. M23 claimed responsibility for the incident."], [16143, 212, "03/14/2014: Assailants attacked the Giwa Army Barracks and a University of Maiduguri hostel in Maiduguri city, Borno state, Nigeria. At least 207 assailants and five other people, including soldiers and at least one student, were killed and an unknown number of people were wounded in the attack. An unknown number of prisoners, who were being held at the base, were freed as a result of the attack. Boko Haram claimed responsibility for the incident."], [16165, 200, "04/05/2014: Assailants opened fire on community leaders and residents that were meeting in Galadima village, Zamfara state, Nigeria. At least 200 people were killed and an unknown number were injured in the attack. No group claimed responsibility for the incident; however, sources attributed the attack to Fulani assailants."], [16175, 287, "04/15/2014: Assailants attacked a mosque being used as a civilian shelter and abducted a number of people in Bentiu town, Unity state, South Sudan. At least 287 people were killed and 400 others were wounded in the attack. This was one of five attacks in Bentiu town on April 15, 2014. No group claimed responsibility for the incident; however, sources attributed the attack to the Sudan People's Liberation Movement in Opposition (SPLM-IO)."], [16195, 315, "05/05/2014: Assailants attacked residents and buildings with firearms and explosive devices in Gomboru Ngala town, Borno state, Nigeria. At least 315 people were killed, an unknown number were injured, and numerous buildings were destroyed in the attack. No group claimed responsibility for the incident; however, sources attributed the attack to Boko Haram."], [16203, 200, "05/13/2014: Assailants attacked residents and buildings in Tsangayari village, Kalabalge district, Borno state, Nigeria. Residents repelled the attack, killing approximately 200 assailants. This was one of three coordinated attacks in district villages by the same assailants. No group claimed responsibility for the incidents; however, sources attributed the attacks to Boko Haram."], [16203, 151, "05/13/2014: Assailants attacked residents and buildings in Garawa village, Kalabalge district, Borno state, Nigeria. Residents repelled the attack, killing approximately 151 assailants. This was one of three coordinated attacks in district villages by the same assailants. No group claimed responsibility for the incidents; however, sources attributed the attacks to Boko Haram."], [16231, 670, "06/10/2014: Assailants stormed Badush prison in Badush city, Nineveh governorate, Iraq. The assailants separated the Shia and Sunni prisoners, releasing the Sunni inmates and killing 670 Shia prisoners. This was one of six coordinated incidents on the same day and one of three similar attacks targeting jails and prisons in the area. Islamic State of Iraq and the Levant (ISIL) claimed responsibility for the incidents."], [16233, 1570, "06/12/2014: Assailants abducted approximately 1686 soldiers from Camp Speicher in Tikrit city, Saladin governorate, Iraq. Two captives escaped custody and at least 1570, if not all of the remaining victims, are presumed dead. The Islamic State of Iraq and the Levant (ISIL) claimed responsibility and stated that the attacks were in revenge for the killing of ISIL leader Abdul-Rahman al-Beilawy."], [16268, 310, "07/17/2014: Assailants attacked National Defense Force soldiers and then the Shaer Gas Field in Homs governorate, Syria. In addition to 40 assailants, 270 people were killed, an unknown number of people were wounded, and an unknown number were taken hostage during the attack. The fate of the hostages is unknown. The Islamic State of Iraq and the Levant (ISIL) claimed responsibility for the incident."], [16268, 298, "07/17/2014: Assailants launched a surface-to-air missile at a Malaysia Airlines aircraft, traveling from Amsterdam to Kuala Lumpur, near Hrabove, Donetsk, Ukraine. At least 298 people, including one United States citizen, were killed in the attack. The Donetsk People's Republic claimed responsibility for the incident; however, authorities questioned the veracity of this claim."], [16285, 953, "08/03/2014: Assailants attacked Yizidi civilians in Sinjar, Nineveh, Iraq. At least 953 people were killed and 5,350 people were abducted in the assault. At least 3,280 of the hostages kidnapped between this incident and a similar incident in Kojo on August 15, 2014 have been released as of May 20, 2018. The whereabouts of the remaining victims are unknown. This was one of three related incidents in Sinjar on this date and one of four attacks in early August 2014 comprising the Sinjar massacre. No group claimed responsibility; however, sources attributed the attack to the Islamic State of Iraq and the Levant (ISIL)."], [16297, 400, "08/15/2014: Assailants attacked Yizidi civilians in Kojo, Nineveh, Iraq. At least 400 people were killed and 1,000 people were abducted in the assault. At least 3,280 of the hostages kidnapped between this incident and a similar incident in Sinjar on August 3, 2014 have been released as of May 20, 2018. The whereabouts of the remaining victims are unknown. This was one of four attacks in early August 2014 comprising the Sinjar massacre. No group claimed responsibility for the incident; however, sources attributed the attack to the Islamic State of Iraq and the Levant (ISIL)."], [16301, 517, "08/19/2014: Assailants attacked Tabqa Air Base in Raqqah governorate, Syria. In addition to 346 assailants, 171 soldiers were killed and 150 soldiers were abducted in the attack, which lasted for five days. An unknown number of hostages were killed; however, the fate of the remaining hostages is unknown. The Islamic State of Iraq and the Levant (ISIL) claimed responsibility for the incident."], [16320, 150, "09/07/2014: Assailants executed 150 former security members in Mosul city, Nineveh governorate, Iraq. No group claimed responsibility; however, sources attributed the attack to the Islamic State of Iraq and the Levant (ISIL)."], [16330, 201, "09/17/2014: Assailants attacked Konduga town, Borno state, Nigeria. At least 201 assailants were killed in the attack. No group claimed responsibility for the incident; however, sources attributed the attack to Boko Haram."], [16372, 150, "10/29/2014: Assailants kidnapped 150 members of the Albu Nimr tribe from villages near Ramadi city, Al Anbar governorate, Iraq. The victims were executed and buried in Albu Ali al-Jasim area. No group claimed responsibility for the incident; however, sources attributed the attack to Islamic State of Iraq and the Levant (ISIL)."], [16380, 201, "11/06/2014: Assailants opened fire on the airport in Donetsk city, Donetsk oblast, Ukraine. One paratrooper and 200 assailants were killed in the attack. The Donetsk People's Republic claimed responsibility for the incident, stating that they had been attempting to repel an attack by the military."], [16415, 180, "12/11/2014: Assailants opened fire on security forces in Am Chide town, Extreme-North region, Cameroon. At least 180 attackers were killed when soldiers returned fire. No group claimed responsibility; however, sources attributed the incident to Boko Haram."], [16420, 158, "12/16/2014: Assailants detonated an explosives-laden vehicle and then stormed the Army Public School in Peshawar city, Khyber Pakhtunkhwa province, Pakistan. At least 151 students and staff were killed and more than 120 other people were injured in the attack. Additionally, all seven assailants were either killed by security forces or detonated their explosives-laden vests. Finally, several explosive devices planted in the school by the assailants were defused after the attack. Tehrik-i-Taliban Pakistan (TTP) claimed responsibility for the incident, stating that it was revenge for Operation Zarb-e-Azb in North Waziristan. The Mullah Fazlullah Group also claimed responsibility for the attack."], [16420, 150, "12/16/2014: Assailants killed 150 women in Fallujah city, Al Anbar governorate, Iraq. No group claimed responsibility for the incident; however, sources attributed the attack to Islamic State of Iraq and the Levant (ISIL), noting that the victims had refused to engage in a jihad marriage."], [16490, 208, "02/24/2015: Assailants attacked Chadian Multinational Joint Task Force (MNJTF) positions near Gambaru, Borno, Nigeria. In addition to an unknown number of assailant casualties, at least one soldier was killed and nine soldiers were injured in the ensuing clash. No group claimed responsibility for the incident; however, sources attributed the attack to Boko Haram."], [16527, 152, "04/02/2015: Assailants armed with grenades and firearms attacked students at Garissa University College in Garissa city, Garissa county, Kenya. The assailants targeted the Christian and non-Muslim students, executing them and holding them hostage for 13 hours before security forces succeeded in ending the siege. At least 152 people, including 142 students, six security personnel, and all four assailants, were killed and 104 others were injured in the assault. Al-Shabaab claimed responsibility and stated that the attack was carried out in retaliation for Kenya's military involvement in Somalia."], [16534, 300, "04/09/2015: Assailants executed 300 tribal civilians in Qaim, Al Anbar governorate, Iraq. No group claimed responsibility; however, sources attributed the attack to the Islamic State of Iraq and the Levant (ISIL)."], [16550, 230, "04/25/2015: Assailants attacked a military base and residential areas in Karamga, Lake Chad area, Diffa region, Niger. At least 46 soldiers, 28 civilians, and 156 assailants were killed and nine soldiers and an unknown number of assailants were injured in the attack. No group claimed responsibility for the incident; however, sources attributed the attack to Boko Haram."], [16548, 200, "04/23/2015: Assailants attacked and killed at least 200 civilians in Ishtabraq, Idlib governorate, Syria. This was one of four related incidents in the area on the same day. The attacks lasted until April 25, 2015. Additionally, at least 100 people, including government soldiers, militia fighters, and their families, were abducted across all four incidents and their whereabouts are unknown. Ansar al-Din Front claimed responsibility for the attack. However, sources attributed the incident to Al-Nusrah Front."], [16576, 280, "05/21/2015: Assailants executed at least 280 people, including government employees, Syrian Armed Forces (SAF) soldiers, Popular Committees members, and civilians in Palmyra, Homs governorate, Syria. The executions occurred over a four day period, lasting until May 25, 2015. No group claimed responsibility; however, sources attributed the attack to the Islamic State of Iraq and the Levant (ISIL)."], [16611, 174, "06/25/2015: Assailants detonated an explosives-laden vehicle near the Syrian Border Police border crossing in Kobani, Aleppo governorate, Syria. Following the blast, assailants stormed the town and detonated two more explosives-laden vehicles and also opened fire on security forces. At least 174 people, including security forces, civilians, and 54 assailants, were killed and more than 200 people were injured in the attack. This was one of two related incidents in and around Kobani on the same day. The Islamic State of Iraq and the Levant (ISIL) claimed responsibility for the attacks."], [16660, 174, "08/13/2015: Assailants opened fire on residents in Kukuwa-Gari village, Yobe state, Nigeria. At least 160 people were killed by gunfire or drowning as they tried to escape by jumping in a nearby river. In addition, 14 assailants were killed following the raid. No group claimed responsibility for the incident; however, sources attributed the attack to Boko Haram, noting the assault was likely reprisal for the death of two Boko Haram members."], [16706, 240, "09/28/2015: Assailants raided Kunduz city, Afghanistan. The assailants attacked civilians and security force members, stormed the prison and released more than 500 inmates, set fire to an unknown number of buildings, and gained control of the city. At least four people and 20 assailants were killed and 50 people were injured during the preliminary raid. Clashes continued until security forces regained control of Kunduz on October 1, 2015. After four days of fighting, 40 people and 200 assailants were reported dead and 296 people were injured. This was one of three coordinated attacks in Kunduz on the same day. The Taliban claimed responsibility for the incident."], [16739, 224, "10/31/2015: An explosive device detonated on a Kogalymavia passenger flight traveling from Sharm el-Sheikh, Egypt to Saint Petersburg, Russia. The plane crashed in North Sinai, Egypt, killing all 224 people on board. The Sinai Province of the Islamic State claimed responsibility for the attack."], [16838, 300, "02/07/2016: Assailants executed 300 civilian activists and security force members in Mosul, Nineveh, Iraq. No group claimed responsibility for the incident; however, sources attributed the attack to the Islamic State of Iraq and the Levant (ISIL)."], [16912, 250, "04/21/2016: Assailants executed 250 women in Mosul, Nineveh, Iraq. No group claimed responsibility for the incident; however, sources attributed the attack to the Islamic State of Iraq and the Levant (ISIL), stating that the victims had refused to marry ISIL members."], [16985, 383, "07/03/2016: A suicide bomber detonated an explosives-laden vehicle at a shopping center in Karada neighborhood, Baghdad, Iraq. In addition to the bomber, at least 382 people were killed and 200 others were injured in the blast. The Islamic State of Iraq and the Levant (ISIL) claimed responsibility for the attack."], [17032, 283, "08/19/2016: Assailants attacked Pajut, Jonglei, South Sudan. At least 250 assailants and 33 people, including civilians and soldiers, were killed and an unknown number were injured in the ensuing clash. No group claimed responsibility for the incident; however, sources attributed the attack to the Sudan People's Liberation Movement in Opposition (SPLM-IO)."], [17077, 154, "10/03/2016: Assailants attacked Kunduz city, Kunduz, Afghanistan. At least 154 people were killed and 120 people were injured in the ensuing clashes which lasted until October 9, 2016. The casualties included assailants, security forces, and civilians. The Taliban claimed responsibility for the incident and demanded that the United States remove all American armed forces from Afghanistan."], [17095, 284, "10/21/2016: Assailants abducted 284 civilians in Mosul, Nineveh, Iraq. All of the hostages were shot and killed in three waves at the Agricultural Facility in Mosul on October 22, 2016. No group claimed responsibility for the incident; however, sources attributed the attack to the Islamic State of Iraq and the Levant (ISIL)."], [17100, 190, "10/26/2016: Assailants executed 190 people in Hammam al-Alil, Nineveh, Iraq. No group claimed responsibility for the incident; however, sources attributed the attack to the Islamic State of Iraq and the Levant (ISIL)."], [17145, 433, "12/10/2016: Assailants, including suicide bombers, armed with explosives-laden vehicles, projectiles, and firearms, attacked Palmyra in Homs, Syria. At least 421 people, including 301 assailants, were killed and an unknown number of other people were injured in the ensuing clash that lasted until December 11, 2016. Additionally, an unknown number of people were abducted. At least 12 hostages were executed on January 19, 2017 while the fate of the remaining victims is unknown. The Islamic State of Iraq and the Levant (ISIL) claimed responsibility for the incident."], [17242, 230, "03/17/2017: Assailants stormed a residential building and took civilians hostages in Maawsil al-Jadidah neighborhood, Mosul, Nineveh, Iraq. The assailants then planted explosives-laden vehicles around the houses and positioned snipers on the rooftops to target security forces. A United States airstrike hit the houses, detonating the vehicles. An unknown number of hostages were killed in the blasts and subsequent building collapse. No group claimed responsibility; however, sources attributed the attack to the Islamic State of Iraq and the Levant (ISIL)."], [17254, 151, "03/29/2017: Assailants attacked the Iraqi Volunteer Forces frontlines between Tal Afar district and Al Qayrawan subdistrict in Nineveh, Iraq. Security forces repelled the assault, killing more than 150 assailants. No group claimed responsibility; however, sources attributed the attack to the Islamic State of Iraq and the Levant (ISIL)."], [17277, 266, "04/21/2017: Assailants, including suicide bombers, attacked a military base in Mazari Sharif, Balkh, Afghanistan. At least 256 soldiers and 10 assailants were killed and 64 soldiers were injured in the ensuing clash. The Taliban claimed responsibility for the incident and stated that the attack was carried out in retaliation for the death of two Taliban members in the area. In addition, sources also suspected that the Haqqani Network may have been involved in the attack."], [17318, 163, "06/01/2017: Snipers opened fire on fleeing civilians in Zanjili neighborhood, Mosul, Iraq. At least 163 people were killed in the assault. This was one of two attacks targeting fleeing civilians in Zanjili on the same day. The Islamic State of Iraq and the Levant (ISIL) claimed responsibility for the incidents."], [17321, 200, "06/04/2017: Assailants abducted 200 Turkmen civilians from Tal Afar, Nineveh, Iraq. The hostages were executed on July 4, 2017. No group claimed responsibility for the incident; however, sources attributed the attack to the Islamic State of Iraq and the Levant (ISIL)."], [17437, 153, "09/28/2017: Assailants, including suicide bombers in explosives-laden vehicles, attacked Syrian Army soldiers in Qaryatayn, Homs, Syria. At least 153 soldiers were killed and an unknown number of other soldiers were injured in the ensuing clash, which lasted until October 2, 2017. There were also an unknown number of assailant casualties in the incident. No group claimed responsibility; however, sources attributed the attack to the Islamic State of Iraq and the Levant (ISIL)."], [17453, 588, "10/14/2017: A suicide bomber detonated an explosives-laden truck outside the Safari Hotel at the K5 intersection in Hodan neighborhood, Mogadishu, Somalia. In addition to the assailant, at least 588 people, including three United States citizens, were killed and 316 people were injured in the blast. This was one of two coordinated suicide attacks in Mogadishu on this date; the assailants intended to target Aden Adde International Airport. Al-Shabaab claimed responsibility for the incidents."], [17494, 311, "11/24/2017: Assailants detonated an explosive device and opened fire on Al-Rawda mosque in Al-Rawda, Beir al-Abd, North Sinai, Egypt. At least 311 people were killed and 127 people were injured in the attack. The Sinai Province of the Islamic State claimed responsibility for the incident. In addition, the Sons of Jesus Movement claimed responsibility and stated that the attack was carried out in revenge for attacks targeting members of the Christian community, though sources questioned the veracity of this claim."]]